---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingInRoutingError
source: html/46f74c41-257c-9ef1-86f7-474320ad0eee.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingInRoutingError Property

The fitting that is converted to was not defined. Please assign one in the routing preference.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoFittingInRoutingError { get; }
```